{"class_name": "Model", "config": {"layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"input_dtype": "float32", "batch_input_shape": [null, 1, 64, 64], "name": "input_1"}, "inbound_nodes": []}, {"name": "conv2D-0", "class_name": "Convolution2D", "config": {"nb_filter": 8, "nb_row": 3, "b_constraint": null, "trainable": true, "name": "conv2D-0", "nb_col": 3, "b_regularizer": null, "dim_ordering": "th", "border_mode": "same", "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "subsample": [1, 1], "activation": "relu", "bias": true}, "inbound_nodes": [[["input_1", 0, 0]]]}, {"name": "batchnormalization_1", "class_name": "BatchNormalization", "config": {"momentum": 0.9, "trainable": true, "name": "batchnormalization_1", "mode": 2, "axis": 1, "epsilon": 1e-06}, "inbound_nodes": [[["conv2D-0", 0, 0]]]}, {"name": "maxPool-0", "class_name": "MaxPooling2D", "config": {"trainable": true, "name": "maxPool-0", "strides": [2, 2], "dim_ordering": "th", "border_mode": "valid", "pool_size": [2, 2]}, "inbound_nodes": [[["batchnormalization_1", 0, 0]]]}, {"name": "conv2D-1", "class_name": "Convolution2D", "config": {"nb_filter": 16, "nb_row": 3, "b_constraint": null, "trainable": true, "name": "conv2D-1", "nb_col": 3, "b_regularizer": null, "dim_ordering": "th", "border_mode": "same", "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "subsample": [1, 1], "activation": "relu", "bias": true}, "inbound_nodes": [[["maxPool-0", 0, 0]]]}, {"name": "batchnormalization_2", "class_name": "BatchNormalization", "config": {"momentum": 0.9, "trainable": true, "name": "batchnormalization_2", "mode": 2, "axis": 1, "epsilon": 1e-06}, "inbound_nodes": [[["conv2D-1", 0, 0]]]}, {"name": "maxPool-1", "class_name": "MaxPooling2D", "config": {"trainable": true, "name": "maxPool-1", "strides": [2, 2], "dim_ordering": "th", "border_mode": "valid", "pool_size": [2, 2]}, "inbound_nodes": [[["batchnormalization_2", 0, 0]]]}, {"name": "conv2D-2", "class_name": "Convolution2D", "config": {"nb_filter": 32, "nb_row": 3, "b_constraint": null, "trainable": true, "name": "conv2D-2", "nb_col": 3, "b_regularizer": null, "dim_ordering": "th", "border_mode": "same", "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "subsample": [1, 1], "activation": "relu", "bias": true}, "inbound_nodes": [[["maxPool-1", 0, 0]]]}, {"name": "batchnormalization_3", "class_name": "BatchNormalization", "config": {"momentum": 0.9, "trainable": true, "name": "batchnormalization_3", "mode": 2, "axis": 1, "epsilon": 1e-06}, "inbound_nodes": [[["conv2D-2", 0, 0]]]}, {"name": "maxPool-2", "class_name": "MaxPooling2D", "config": {"trainable": true, "name": "maxPool-2", "strides": [2, 2], "dim_ordering": "th", "border_mode": "valid", "pool_size": [2, 2]}, "inbound_nodes": [[["batchnormalization_3", 0, 0]]]}, {"name": "conv2D-3", "class_name": "Convolution2D", "config": {"nb_filter": 64, "nb_row": 3, "b_constraint": null, "trainable": true, "name": "conv2D-3", "nb_col": 3, "b_regularizer": null, "dim_ordering": "th", "border_mode": "same", "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "subsample": [1, 1], "activation": "relu", "bias": true}, "inbound_nodes": [[["maxPool-2", 0, 0]]]}, {"name": "batchnormalization_4", "class_name": "BatchNormalization", "config": {"momentum": 0.9, "trainable": true, "name": "batchnormalization_4", "mode": 2, "axis": 1, "epsilon": 1e-06}, "inbound_nodes": [[["conv2D-3", 0, 0]]]}, {"name": "maxPool-3", "class_name": "MaxPooling2D", "config": {"trainable": true, "name": "maxPool-3", "strides": [2, 2], "dim_ordering": "th", "border_mode": "valid", "pool_size": [2, 2]}, "inbound_nodes": [[["batchnormalization_4", 0, 0]]]}, {"name": "conv2D-4", "class_name": "Convolution2D", "config": {"nb_filter": 128, "nb_row": 4, "b_constraint": null, "trainable": true, "name": "conv2D-4", "nb_col": 4, "b_regularizer": null, "dim_ordering": "th", "border_mode": "valid", "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "subsample": [1, 1], "activation": "tanh", "bias": true}, "inbound_nodes": [[["maxPool-3", 0, 0]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["conv2D-4", 0, 0]], "name": "model_2"}, "keras_version": "1.0.4"}